Обработки/Reports/_ЛиквидностьПортфелей_ПН_ПР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ЛиквидностьПортфелей_ПН_ПР</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ЛиквидностьПортфелей_ПН_ПР/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Ликвидность портфелей ПН и ПР",
		"0.6",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ИмяПредопределенногоВарианта = РаботаСОтчетамиКлиентСервер.ПолучитьИмяПредопределенногоВариантаОтчета(ЭтотОбъект);
			
	Настройки = КомпоновщикНастроек.Настройки;
	Параметры = Настройки.ПараметрыДанных;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу КАК НаименованиеКлиента
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ЮрФизЛицо = &Клиент
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", 		ЭтотОбъект.Период);
	Запрос.УстановитьПараметр("Клиент", 		ЭтотОбъект.Клиент);
	Запрос.УстановитьПараметр("Организация", 	ЭтотОбъект.Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отстуствуют анкетные данные по клиенту");
		Возврат;
	КонецЕсли;	
	
	Параметры.УстановитьЗначениеПараметра("Период",					КонецДня(ЭтотОбъект.Период));
	Параметры.УстановитьЗначениеПараметра("НачалоМесяца",			?(ЭтотОбъект.Период <= '20220331', '20220316', НачалоМесяца(ДобавитьМесяц(ЭтотОбъект.Период, 1))));
	Параметры.УстановитьЗначениеПараметра("ПериодГраница",			Новый Граница(КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая));
	Параметры.УстановитьЗначениеПараметра("ДатаОтчета",				Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy"));
	Параметры.УстановитьЗначениеПараметра("Организация", 			ЭтотОбъект.Организация);	
	Параметры.УстановитьЗначениеПараметра("Клиент", 				ЭтотОбъект.Клиент);
	Параметры.УстановитьЗначениеПараметра("НаименованиеКлиента", 	Выборка.НаименованиеКлиента);
			
	// Выполняем программную компоновку
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);	
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("ВариантОтчета");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Возврат Настройки;

КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления,Клиент");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".АвтоматическоеФормирование()";
	
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.Период = НачалоДня(НастройкиОтчета.Период.ДатаОкончания);
	
	РаботаСОтчетамиКлиентСервер.ЗаполнитьДополнительныеСвойстваВариантаОтчета(ЭтотОбъект, НастройкиОтчета.ВариантОтчета);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
			
КонецПроцедуры
